# ShowUpText Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsPath..::..ShowUpText Property
StairsPath Class See Also
---
Represents whether show stairs up text or not.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool ShowUpText { get; set; }
```

Visual Basic
---
```text
Public Property ShowUpText As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShowUpText {
	bool get ();
	void set (bool value);
}
```

# See Also
StairsPath Class
Autodesk.Revit.DB.Architecture Namespace